#include <stdio.h>
#include <string.h>
#include <unistd.h>

/************************************************************************/
/*                                                                      */
/************************************************************************/


/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{
    int i = 0;
    char buf[102] = {0};
    char* lable = "|/-\\";
    
    for(i = 0; i <= 100; i++) {
        //格式化输出，'-'表示左对齐，100表示固定列宽，然后'\r' 表示回车，即每次打印完使光标回到最开始位置
        printf("[%-100s][%d%%][%c]\r", buf, i, lable[i%4]);
        //printf是行缓冲输出，靠\n输出，这里没有\n所以通过fflush强制输出
        fflush(stdout);
        buf[i] = '=';
        usleep(100000);
    }
    printf("\n");
    
    return 0;
}