#include <stdio.h>

/************************************************************************/
/*                                                                      */
/************************************************************************/
void test_define(void)
{
    printf("__STDC_ISO_10646__ :%ld\n", __STDC_ISO_10646__ );    //(C99 )定义为长整型常量，yyyymmL表示wchai_t值遵循ISO 10646标准及其指定年月的修订补充，否则该宏为未定义
                                                                 //编译程序支持，用于说明ISO/IEC 10646标准的年和月格式：yyymmmL
                                                                 //__STDC_ISO_10646__ :200009
}

/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{
    test_define();

    return 0;
}