#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

/************************************************************************/
/*                                                                      */
/************************************************************************/


/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{
    char buf[L_tmpnam];
    char *ptr;

    //生成并返回一个有效的临时文件名，该文件名之前是不存在的。如果 str 为空，则只会返回临时文件名。
    ptr = tmpnam(NULL);
    printf("%s\n", ptr);
    
    ptr = tmpnam(buf);
    printf("%s\n", ptr);
    printf("%s\n", buf);
    
    return 0;
}