#include <stdio.h>
#include <ctype.h>

/************************************************************************/
/*                                                                      */
/************************************************************************/


/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{ 
    int i = 0, j = 0;
    char str1[] = "hello \a world \t !!!";
    char str2[] = "test \n code";

    /* 输出字符串直到控制字符 \a */
    while(!iscntrl(str1[i])) 
    {
        putchar(str1[i]);
        i++;
    }

    /* 输出字符串直到控制字符 \n */
    while(!iscntrl(str2[j])) 
    {
        putchar(str2[j]);
        j++;
    }
    
    //打印结果hello test 
    
    printf("\n");
   
    return 0;
}