#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

#include <sys/stat.h>

/************************************************************************/
/*                                                                      */
/************************************************************************/
/*
rmdir函数

int rmdir(const char *pathname);
*/

/***************************************************
** description：该函数用于删除一个目录，目录必须为空
** parameter：
        ** *pathname 需要删除的目录名字
 ** return：目录删除成功，则返回0；否则返回-1，并设置 errno 以指示错误。
****************************************************/


/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{
    // if(0 != mkdir("./hello", 0777)) {
        // perror("mkdir:");
        // return -1;
    // }
    
    if(0 != rmdir("./hello")) {
        perror("rmdir:");
        return -1;
    }
    return 0;
}