#include <stdio.h>

/************************************************************************/
/*                                                                      */
/************************************************************************/
void test_define(void)
{ 
    printf("__STDC_HOSTED__ :%d\n", __STDC_HOSTED__ );    //(C99)如果当前是宿主系统，则该宏的值为1;
                                                          //如果当前是独立系统，则该宏的值为0;若操作系统存在，则为1;
                                                          //如果编译器的目标系统环境中包含完整的标准C库，那么这个宏就定义为1，否则宏的值为0
                                                          //__STDC_HOSTED__ :1
}

/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{
    test_define();

    return 0;
}