// #include <stdio.h>
// #include <stdlib.h>
// #include <string.h>
// #include <stdint.h>
#include <unistd.h>

#include "printf.h"
/************************************************************************/
/*                                                                      */
/************************************************************************/
void _putchar(char character)
{
    write(1, &character, 1); // 1 标准输出
}
/************************************************************************/
/*                                                                      */
/************************************************************************/

int main(int argc, char* argv[])
{
    //取代标准库的printf
    
    //把111打印出来
    printf("%d\n", 111); //产生"111"
    printf("%i\n", 111); //产生"111"
    printf("%u\n", 111); //产生"111"
    
    //把-111打印出来
    printf("%d\n", -111); //产生"-111"
    printf("%i\n", -111); //产生"-111"
    printf("%u\n", -111); //产生"4294967185"

    //把整数123 整数4567 打印出来。不足的左边补空格
    printf("%4d%4d\n", 123,4567); //产生：“ 1234567"
    
    //两个整数形成带小数点的字符串，极大的方便了不支持做浮点运算，且需要小数点
    printf("%d%c%d\n", 1,'.',345); //产生：1.345
    
    //一个浮点型数据形成浮点型字符串
    printf("%4.2f\n", 1234.244); //产生：“1234.24“
    
    //输出字符
    printf("%c %c\n", 'G', 'O'); //产生：“G O“
    
    //输出字符串
    printf("%s\n", "Hello World"); //产生：“Hello World“
    
    int val = 15;
    //输出八进制
    printf("%o\n", val); //产生：“17“
    //输出小写十六进制
    printf("%x\n", val); //产生：“f“
    //输出大写十六进制
    printf("%X\n", val); //产生：“F“
    //输出地址
    printf("%p\n", &val); //产生：“00007FFFE0EC9048“
    
/************************************************************************/

    char str[10] = {0};
    
    //取代标准库的sprintf
    
    //把111存储到了str数组中，存储为“111”
    sprintf(str, "%d", 111); //产生"111"
    
    printf("test 1:%s\n", str);

    //把整数123 整数4567 打印成一个字符串保存在str 中。不足的左边补空格
    sprintf(str, "%4d%4d", 123,4567); //产生：“ 1234567"
    
    printf("test 2:%s\n", str);
    
    //两个整数形成带小数点的字符串，极大的方便了不支持做浮点运算，且需要小数点
    sprintf(str, "%d%c%d", 1,'.',345); //产生：1.345
    
    printf("test 3:%s\n", str);
    
    //一个浮点型数据形成浮点型字符串
    sprintf(str, "%4.2f", 1234.244); //产生：“1234.24“
    
    printf("test 4:%s\n", str);
    
    //一个浮点型数据形成浮点型字符串，后添加单位
    sprintf(str, "%4.2f%s", 1234.244,"cm"); //产生：“1234.24cm”
    
    printf("test 5:%s\n", str);
    
/************************************************************************/
    //取代标准库的snprintf

    //把111存储到了str数组中，存储为“111”
    snprintf(str, 10, "%d", 111); //产生"111"
    
    printf("test 1:%s\n", str);

    //把整数123 整数4567 打印成一个字符串保存在str 中。不足的左边补空格
    snprintf(str, 10, "%4d%4d", 123,4567); //产生：“ 1234567"
    
    printf("test 2:%s\n", str);
    
    //两个整数形成带小数点的字符串，极大的方便了不支持做浮点运算，且需要小数点
    snprintf(str, 10, "%d%c%d", 1,'.',345); //产生：1.345
    
    printf("test 3:%s\n", str);
    
    //一个浮点型数据形成浮点型字符串
    snprintf(str, 10, "%4.2f", 1234.244); //产生：“1234.24“
    
    printf("test 4:%s\n", str);
    
    //一个浮点型数据形成浮点型字符串，后添加单位
    snprintf(str, 10, "%4.2f%s", 1234.244,"cm"); //产生：“1234.24cm”
    
    printf("test 5:%s\n", str);
    
    return 0;
}